// 1. Дан следующий объект: 
// let obj = {
// 	1: {
// 		1: 11,
// 		2: 12,
// 		3: 13,
// 	},
// 	2: {
// 		1: 21,
// 		2: 22,
// 		3: 23,
// 	},
// 	3: {
// 		1: 24,
// 		2: 25,
// 		3: 26,
// 	},
// }
// Найдите сумму элементов этого объекта. 

let obj = {
  1: {
    1: 11,
    2: 12,
    3: 13,
  },
  2: {
    1: 21,
    2: 22,
    3: 23,
  },
  3: {
    1: 24,
    2: 25,
    3: 26,
  },
};

let sum = 0;

// Перебираем ключи первого уровня
for (let key in obj) {
  // Перебираем ключи второго уровня
  for (let innerKey in obj[key]) {
    sum += obj[key][innerKey]; // Добавляем значение к сумме
  }
}

console.log(sum); // Вывод: 171

